InformationRegisters/бит_НастройкаОтчетаГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкаОтчетаГЦЖС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПолеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПоляExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФорматКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоляExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_НастройкаОтчетаГЦЖС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
	Этаформа.Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
 РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаполнениеПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере(ЭтотОбъект.Элементы.Список.ТекущиеДанные.ИмяПоляExcel);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере(НачальноеПоле)
	
 НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей(); 
 НаборЗаписей.Прочитать();
 
 таблицаНабора = НаборЗаписей.Выгрузить();
 таблицаНабора.Сортировать("НомерПоляExcel");
 
 Пересчитывать = ложь;
 НачальныйНомер = 0;
 для каждого стр из таблицаНабора цикл
	 
	 если стр.ИмяПоляExcel = НачальноеПоле тогда	 		 
		
		Пересчитывать = истина;
        НачальныйНомер = стр.НомерПоляExcel;
		НовыйНомер = стр.НомерПоляExcel + 1;
 
	 конецесли;	 
	 
	 если Пересчитывать = истина тогда
	    стр.НомерПоляExcel = НовыйНомер;//стр.НомерПоляExcel + 1;				
		НовыйНомер = НовыйНомер + 1;
	 конецесли;	
	 
 конеццикла;
 
 Построитель = Новый ПостроительЗапроса;
 Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(таблицаНабора);
 
 тОтбор = Построитель.Отбор.Добавить("НомерПоляExcel");
 тОтбор.ВидСравнения = ВидСравнения.Больше;
 тОтбор.Значение = НачальныйНомер;
 тОтбор.Использование = Истина;
 
 Построитель.Выполнить();
 ТабРезультат = Построитель.Результат.Выгрузить();
 
 для каждого стр из ТабРезультат цикл 
	 
	  НаборЗаписей.Отбор.ИмяПоляExcel.Установить(стр.ИмяПоляExcel);	  
      НаборЗаписей.Прочитать();

      если НаборЗаписей.Количество() > 0 тогда
	    НаборЗаписей[0].НомерПоляExcel = стр.НомерПоляExcel; 
	    НаборЗаписей.Записать();
      конецесли;

 конеццикла;

 Этаформа.Элементы.Список.Обновить();
  
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = "Сохранить настройки в файл";
	ДиалогВыбораФайла.Фильтр    = "XML (*.xml)|*.xml|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		СохранитьНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);		
	КонецЕсли;

	КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(ИмяФайла)
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ЗаписатьДанныеВФорматеXML(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Загрузка настройки из файла";
	ДиалогВыбораФайла.Фильтр    = "XML (*.xml)|*.xml|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ЗагрузитьНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);		
	КонецЕсли;	
	Этаформа.Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ИмяФайла)
	РегистрыСведений.бит_НастройкаОтчетаГЦЖС.ПрочитатьДанныеВФорматеXML(ИмяФайла)
КонецПроцедуры
